


""""

{0 1 2 3 4 5 6 7 8 9 } - 10 cc
{0 1} - 2 cc
{0 1 2 3 4 5 6 7} - 8 Cc
{0 1 2 3 4 5 6 7 9 A B C D E F} - 16 cc

0 - 00 
1 - 01
2 - 10
3 - 11 
4 - 100
5 - 101
6 - 110
7 - 111
8 - 1000
"""

"""
375 - 10 cc

375/2 = 187 (ост 1)
187/2 = 93 (ост 1)
93/2 = 46 (ост 1)
46/2 = 23 (ост 0)
23/2 = 11 (ост 1)
11/2 = 5 (ост 1)
5/2 = 2 (ост 1)
2/2 = 1 (ост 0)
1/2 = 0 (ост 1)

101110111 - 2 сс 

1 - 8 раз
0 - 7 раз
1 - 6 раз
1 - 5 раз
1 - 4 раз
0 - 3 раз
1 - 2 раз
1 - 1 раз
1 - 0 раз

1*2^8 + 0*2^7 + 1*2^6 + 1*2^5 + 1*2^4 + 0*2^3 + 1*2^2 + 1*2^1 + 1*2^0  = 
1*2^8  + 1*2^6 + 1*2^5 + 1*2^4 + 1*2^2 + 1*2^1 + 1*2^0  = 256 + 64  + 32 +  16 + 4 + 2 + 1 = 375 10сс
"""

"""
Напишите программу, которая переводит число из десятичной системы счисления в двоичную.
"""


a = 375

while a !=0:
    print(a, a//2, a%2)
    a = a//2

    
